sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_DOUT3_0 Bits */
/* GPIO_DOUT3_0[DIO0] Bits */
#define GPIO_DOUT3_0_DIO0_OFS                    (0)                             /* !< DIO0 Offset */
#define GPIO_DOUT3_0_DIO0_MASK                   ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO0 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIO_DOUT3_0_DIO0_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT3_0_DIO0_ONE                    ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIO_DOUT3_0[DIO1] Bits */
#define GPIO_DOUT3_0_DIO1_OFS                    (8)                             /* !< DIO1 Offset */
#define GPIO_DOUT3_0_DIO1_MASK                   ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO1 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIO_DOUT3_0_DIO1_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT3_0_DIO1_ONE                    ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIO_DOUT3_0[DIO2] Bits */
#define GPIO_DOUT3_0_DIO2_OFS                    (16)                            /* !< DIO2 Offset */
#define GPIO_DOUT3_0_DIO2_MASK                   ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO2 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIO_DOUT3_0_DIO2_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT3_0_DIO2_ONE                    ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIO_DOUT3_0[DIO3] Bits */
#define GPIO_DOUT3_0_DIO3_OFS                    (24)                            /* !< DIO3 Offset */
#define GPIO_DOUT3_0_DIO3_MASK                   ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO3 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIO_DOUT3_0_DIO3_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT3_0_DIO3_ONE                    ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIO_DOUT7_4 Bits */
/* GPIO_DOUT7_4[DIO4] Bits */
#define GPIO_DOUT7_4_DIO4_OFS                    (0)                             /* !< DIO4 Offset */
#define GPIO_DOUT7_4_DIO4_MASK                   ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO4 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIO_DOUT7_4_DIO4_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT7_4_DIO4_ONE                    ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIO_DOUT7_4[DIO5] Bits */
#define GPIO_DOUT7_4_DIO5_OFS                    (8)                             /* !< DIO5 Offset */
#define GPIO_DOUT7_4_DIO5_MASK                   ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO5 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIO_DOUT7_4_DIO5_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT7_4_DIO5_ONE                    ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIO_DOUT7_4[DIO6] Bits */
#define GPIO_DOUT7_4_DIO6_OFS                    (16)                            /* !< DIO6 Offset */
#define GPIO_DOUT7_4_DIO6_MASK                   ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO6 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIO_DOUT7_4_DIO6_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT7_4_DIO6_ONE                    ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIO_DOUT7_4[DIO7] Bits */
#define GPIO_DOUT7_4_DIO7_OFS                    (24)                            /* !< DIO7 Offset */
#define GPIO_DOUT7_4_DIO7_MASK                   ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO7 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIO_DOUT7_4_DIO7_ZERO                   ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT7_4_DIO7_ONE                    ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIO_DOUT11_8 Bits */
/* GPIO_DOUT11_8[DIO8] Bits */
#define GPIO_DOUT11_8_DIO8_OFS                   (0)                             /* !< DIO8 Offset */
#define GPIO_DOUT11_8_DIO8_MASK                  ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO8 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIO_DOUT11_8_DIO8_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT11_8_DIO8_ONE                   ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIO_DOUT11_8[DIO9] Bits */
#define GPIO_DOUT11_8_DIO9_OFS                   (8)                             /* !< DIO9 Offset */
#define GPIO_DOUT11_8_DIO9_MASK                  ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO9 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIO_DOUT11_8_DIO9_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT11_8_DIO9_ONE                   ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIO_DOUT11_8[DIO10] Bits */
#define GPIO_DOUT11_8_DIO10_OFS                  (16)                            /* !< DIO10 Offset */
#define GPIO_DOUT11_8_DIO10_MASK                 ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO10 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT11_8_DIO10_ZERO                 ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT11_8_DIO10_ONE                  ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIO_DOUT11_8[DIO11] Bits */
#define GPIO_DOUT11_8_DIO11_OFS                  (24)                            /* !< DIO11 Offset */
#define GPIO_DOUT11_8_DIO11_MASK                 ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO11 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT11_8_DIO11_ZERO                 ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT11_8_DIO11_ONE                  ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIO_DOUT15_12 Bits */
/* GPIO_DOUT15_12[DIO12] Bits */
#define GPIO_DOUT15_12_DIO12_OFS                 (0)                             /* !< DIO12 Offset */
#define GPIO_DOUT15_12_DIO12_MASK                ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO12 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT15_12_DIO12_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT15_12_DIO12_ONE                 ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIO_DOUT15_12[DIO13] Bits */
#define GPIO_DOUT15_12_DIO13_OFS                 (8)                             /* !< DIO13 Offset */
#define GPIO_DOUT15_12_DIO13_MASK                ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO13 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT15_12_DIO13_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT15_12_DIO13_ONE                 ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIO_DOUT15_12[DIO14] Bits */
#define GPIO_DOUT15_12_DIO14_OFS                 (16)                            /* !< DIO14 Offset */
#define GPIO_DOUT15_12_DIO14_MASK                ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO14 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT15_12_DIO14_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT15_12_DIO14_ONE                 ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIO_DOUT15_12[DIO15] Bits */
#define GPIO_DOUT15_12_DIO15_OFS                 (24)                            /* !< DIO15 Offset */
#define GPIO_DOUT15_12_DIO15_MASK                ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO15 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT15_12_DIO15_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT15_12_DIO15_ONE                 ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIO_DOUT19_16 Bits */
/* GPIO_DOUT19_16[DIO16] Bits */
#define GPIO_DOUT19_16_DIO16_OFS                 (0)                             /* !< DIO16 Offset */
#define GPIO_DOUT19_16_DIO16_MASK                ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO16 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT19_16_DIO16_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT19_16_DIO16_ONE                 ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIO_DOUT19_16[DIO17] Bits */
#define GPIO_DOUT19_16_DIO17_OFS                 (8)                             /* !< DIO17 Offset */
#define GPIO_DOUT19_16_DIO17_MASK                ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO17 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT19_16_DIO17_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT19_16_DIO17_ONE                 ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIO_DOUT19_16[DIO18] Bits */
#define GPIO_DOUT19_16_DIO18_OFS                 (16)                            /* !< DIO18 Offset */
#define GPIO_DOUT19_16_DIO18_MASK                ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO18 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT19_16_DIO18_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT19_16_DIO18_ONE                 ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIO_DOUT19_16[DIO19] Bits */
#define GPIO_DOUT19_16_DIO19_OFS                 (24)                            /* !< DIO19 Offset */
#define GPIO_DOUT19_16_DIO19_MASK                ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO19 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIO_DOUT19_16_DIO19_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIO_DOUT19_16_DIO19_ONE                 ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

