sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_FILTEREN15_0 Bits */
/* GPIO_FILTEREN15_0[DIN0] Bits */
#define GPIO_FILTEREN15_0_DIN0_OFS               (0)                             /* !< DIN0 Offset */
#define GPIO_FILTEREN15_0_DIN0_MASK              ((uint32_t)0x00000003U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN0 */
#define GPIO_FILTEREN15_0_DIN0_DISABLE           ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN0_ONE_CYCLE         ((uint32_t)0x00000001U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN0_THREE_CYCLE       ((uint32_t)0x00000002U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN0_EIGHT_CYCLE       ((uint32_t)0x00000003U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN1] Bits */
#define GPIO_FILTEREN15_0_DIN1_OFS               (2)                             /* !< DIN1 Offset */
#define GPIO_FILTEREN15_0_DIN1_MASK              ((uint32_t)0x0000000CU)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN1 */
#define GPIO_FILTEREN15_0_DIN1_DISABLE           ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN1_ONE_CYCLE         ((uint32_t)0x00000004U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN1_THREE_CYCLE       ((uint32_t)0x00000008U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN1_EIGHT_CYCLE       ((uint32_t)0x0000000CU)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN2] Bits */
#define GPIO_FILTEREN15_0_DIN2_OFS               (4)                             /* !< DIN2 Offset */
#define GPIO_FILTEREN15_0_DIN2_MASK              ((uint32_t)0x00000030U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN2 */
#define GPIO_FILTEREN15_0_DIN2_DISABLE           ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN2_ONE_CYCLE         ((uint32_t)0x00000010U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN2_THREE_CYCLE       ((uint32_t)0x00000020U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN2_EIGHT_CYCLE       ((uint32_t)0x00000030U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN3] Bits */
#define GPIO_FILTEREN15_0_DIN3_OFS               (6)                             /* !< DIN3 Offset */
#define GPIO_FILTEREN15_0_DIN3_MASK              ((uint32_t)0x000000C0U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN3 */
#define GPIO_FILTEREN15_0_DIN3_DISABLE           ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN3_ONE_CYCLE         ((uint32_t)0x00000040U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN3_THREE_CYCLE       ((uint32_t)0x00000080U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN3_EIGHT_CYCLE       ((uint32_t)0x000000C0U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN4] Bits */
#define GPIO_FILTEREN15_0_DIN4_OFS               (8)                             /* !< DIN4 Offset */
#define GPIO_FILTEREN15_0_DIN4_MASK              ((uint32_t)0x00000300U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN4 */
#define GPIO_FILTEREN15_0_DIN4_DISABLE           ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN4_ONE_CYCLE         ((uint32_t)0x00000100U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN4_THREE_CYCLE       ((uint32_t)0x00000200U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN4_EIGHT_CYCLE       ((uint32_t)0x00000300U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN5] Bits */
#define GPIO_FILTEREN15_0_DIN5_OFS               (10)                            /* !< DIN5 Offset */
#define GPIO_FILTEREN15_0_DIN5_MASK              ((uint32_t)0x00000C00U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN5 */
#define GPIO_FILTEREN15_0_DIN5_DISABLE           ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN5_ONE_CYCLE         ((uint32_t)0x00000400U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN5_THREE_CYCLE       ((uint32_t)0x00000800U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN5_EIGHT_CYCLE       ((uint32_t)0x00000C00U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN6] Bits */
#define GPIO_FILTEREN15_0_DIN6_OFS               (12)                            /* !< DIN6 Offset */
#define GPIO_FILTEREN15_0_DIN6_MASK              ((uint32_t)0x00003000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN6 */
#define GPIO_FILTEREN15_0_DIN6_DISABLE           ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN6_ONE_CYCLE         ((uint32_t)0x00001000U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN6_THREE_CYCLE       ((uint32_t)0x00002000U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN6_EIGHT_CYCLE       ((uint32_t)0x00003000U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN7] Bits */
#define GPIO_FILTEREN15_0_DIN7_OFS               (14)                            /* !< DIN7 Offset */
#define GPIO_FILTEREN15_0_DIN7_MASK              ((uint32_t)0x0000C000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN7 */
#define GPIO_FILTEREN15_0_DIN7_DISABLE           ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN7_ONE_CYCLE         ((uint32_t)0x00004000U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN7_THREE_CYCLE       ((uint32_t)0x00008000U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN7_EIGHT_CYCLE       ((uint32_t)0x0000C000U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN8] Bits */
#define GPIO_FILTEREN15_0_DIN8_OFS               (16)                            /* !< DIN8 Offset */
#define GPIO_FILTEREN15_0_DIN8_MASK              ((uint32_t)0x00030000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN8 */
#define GPIO_FILTEREN15_0_DIN8_DISABLE           ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN8_ONE_CYCLE         ((uint32_t)0x00010000U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN8_THREE_CYCLE       ((uint32_t)0x00020000U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN8_EIGHT_CYCLE       ((uint32_t)0x00030000U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN9] Bits */
#define GPIO_FILTEREN15_0_DIN9_OFS               (18)                            /* !< DIN9 Offset */
#define GPIO_FILTEREN15_0_DIN9_MASK              ((uint32_t)0x000C0000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN9 */
#define GPIO_FILTEREN15_0_DIN9_DISABLE           ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN9_ONE_CYCLE         ((uint32_t)0x00040000U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN9_THREE_CYCLE       ((uint32_t)0x00080000U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN9_EIGHT_CYCLE       ((uint32_t)0x000C0000U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN10] Bits */
#define GPIO_FILTEREN15_0_DIN10_OFS              (20)                            /* !< DIN10 Offset */
#define GPIO_FILTEREN15_0_DIN10_MASK             ((uint32_t)0x00300000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN10 */
#define GPIO_FILTEREN15_0_DIN10_DISABLE          ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN10_ONE_CYCLE        ((uint32_t)0x00100000U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN10_THREE_CYCLE      ((uint32_t)0x00200000U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN10_EIGHT_CYCLE      ((uint32_t)0x00300000U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN11] Bits */
#define GPIO_FILTEREN15_0_DIN11_OFS              (22)                            /* !< DIN11 Offset */
#define GPIO_FILTEREN15_0_DIN11_MASK             ((uint32_t)0x00C00000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN11 */
#define GPIO_FILTEREN15_0_DIN11_DISABLE          ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN11_ONE_CYCLE        ((uint32_t)0x00400000U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN11_THREE_CYCLE      ((uint32_t)0x00800000U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN11_EIGHT_CYCLE      ((uint32_t)0x00C00000U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN12] Bits */
#define GPIO_FILTEREN15_0_DIN12_OFS              (24)                            /* !< DIN12 Offset */
#define GPIO_FILTEREN15_0_DIN12_MASK             ((uint32_t)0x03000000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN12 */
#define GPIO_FILTEREN15_0_DIN12_DISABLE          ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN12_ONE_CYCLE        ((uint32_t)0x01000000U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN12_THREE_CYCLE      ((uint32_t)0x02000000U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN12_EIGHT_CYCLE      ((uint32_t)0x03000000U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN13] Bits */
#define GPIO_FILTEREN15_0_DIN13_OFS              (26)                            /* !< DIN13 Offset */
#define GPIO_FILTEREN15_0_DIN13_MASK             ((uint32_t)0x0C000000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN13 */
#define GPIO_FILTEREN15_0_DIN13_DISABLE          ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN13_ONE_CYCLE        ((uint32_t)0x04000000U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN13_THREE_CYCLE      ((uint32_t)0x08000000U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN13_EIGHT_CYCLE      ((uint32_t)0x0C000000U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN14] Bits */
#define GPIO_FILTEREN15_0_DIN14_OFS              (28)                            /* !< DIN14 Offset */
#define GPIO_FILTEREN15_0_DIN14_MASK             ((uint32_t)0x30000000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN14 */
#define GPIO_FILTEREN15_0_DIN14_DISABLE          ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN14_ONE_CYCLE        ((uint32_t)0x10000000U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN14_THREE_CYCLE      ((uint32_t)0x20000000U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN14_EIGHT_CYCLE      ((uint32_t)0x30000000U)         /* !< 8 ULPCLK minimum sample */
/* GPIO_FILTEREN15_0[DIN15] Bits */
#define GPIO_FILTEREN15_0_DIN15_OFS              (30)                            /* !< DIN15 Offset */
#define GPIO_FILTEREN15_0_DIN15_MASK             ((uint32_t)0xC0000000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN15 */
#define GPIO_FILTEREN15_0_DIN15_DISABLE          ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIO_FILTEREN15_0_DIN15_ONE_CYCLE        ((uint32_t)0x40000000U)         /* !< 1 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN15_THREE_CYCLE      ((uint32_t)0x80000000U)         /* !< 3 ULPCLK minimum sample */
#define GPIO_FILTEREN15_0_DIN15_EIGHT_CYCLE      ((uint32_t)0xC0000000U)         /* !< 8 ULPCLK minimum sample */

