sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_SUB1CFG Bits */
/* GPIO_SUB1CFG[ENABLE] Bits */
#define GPIO_SUB1CFG_ENABLE_OFS                  (0)                             /* !< ENABLE Offset */
#define GPIO_SUB1CFG_ENABLE_MASK                 ((uint32_t)0x00000001U)         /* !< This bit is used to enable
                                                                                    subscriber 1 event. */
#define GPIO_SUB1CFG_ENABLE_CLR                  ((uint32_t)0x00000000U)         /* !< Subscriber 1 event is disabled */
#define GPIO_SUB1CFG_ENABLE_SET                  ((uint32_t)0x00000001U)         /* !< Subscriber 1 event is enabled */
/* GPIO_SUB1CFG[OUTPOLICY] Bits */
#define GPIO_SUB1CFG_OUTPOLICY_OFS               (8)                             /* !< OUTPOLICY Offset */
#define GPIO_SUB1CFG_OUTPOLICY_MASK              ((uint32_t)0x00000300U)         /* !< These bits configure the output
                                                                                    policy for subscriber 1 event. */
#define GPIO_SUB1CFG_OUTPOLICY_SET               ((uint32_t)0x00000000U)         /* !< Selected DIO pins are set */
#define GPIO_SUB1CFG_OUTPOLICY_CLR               ((uint32_t)0x00000100U)         /* !< Selected DIO pins are cleared */
#define GPIO_SUB1CFG_OUTPOLICY_TOGGLE            ((uint32_t)0x00000200U)         /* !< Selected DIO pins are toggled */
/* GPIO_SUB1CFG[INDEX] Bits */
#define GPIO_SUB1CFG_INDEX_OFS                   (16)                            /* !< INDEX Offset */
#define GPIO_SUB1CFG_INDEX_MASK                  ((uint32_t)0x000F0000U)         /* !< indicates the specific bit in the
                                                                                    upper 16 bits that is targeted by the
                                                                                    subscriber action */
#define GPIO_SUB1CFG_INDEX_MIN                   ((uint32_t)0x00000000U)         /* !< specific bit targeted by the
                                                                                    subscriber action is bit16 */
#define GPIO_SUB1CFG_INDEX_MAX                   ((uint32_t)0x000F0000U)         /* !< specific bit targeted by the
                                                                                    subscriber action is bit31 */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_gpio__include */
